Revit 2027 API
BuiltInFailures.StairRampFailures.StairsIllegalDesiredNumRisers Property
 Desired Number of Risers is too small. Computed Actual Riser Height is greater than Maximum Riser Height allowed by type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsIllegalDesiredNumRisers { get; }
Public Shared ReadOnly Property StairsIllegalDesiredNumRisers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsIllegalDesiredNumRisers {
	FailureDefinitionId^ get ();
}
static member StairsIllegalDesiredNumRisers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace